Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This is the `@io.quarkus.hibernate.orm.PersistenceUnit` annotation.
ja_jp: これは `@io.quarkus.hibernate.orm.PersistenceUnit` アノテーションです。

source: This is the `SecurityIdentity` created by applicable authentication mechanism with the highest priority.
ja_jp: これは、該当する認証メカニズムによって作成された、最高の優先度を持つ `SecurityIdentity` です。

source: This is the `quarkus-extension.yaml` of the `quarkus-agroal` extension, you can use it as an example:
ja_jp: これは、 `quarkus-agroal` エクステンションの `quarkus-extension.yaml` です。手本として使用することができます:

source: This is the `quarkus-extension.yaml` template of the `quarkus-agroal` extension, you can use it as an example:
ja_jp: これは、 `quarkus-agroal` エクステンションの `quarkus-extension.yaml` です。手本として使用することができます:

source: This is the beginning of a great story: Quarkus 1.11 offers a UI dedicated to development to make it easier than ever.
ja_jp: これは素晴らしい物語の始まりです。Quarkus 1.11では、開発をこれまで以上に簡単にする為に、特化したUIが提供されました。

source: This is the class the event will be deserialized to.
ja_jp: これはトリガーのイベントデータがデシリアライズされるクラスです。

source: This is the data being collected
ja_jp: これが収集されたデータです。

source: This is the default behavior of an application subscribing to a Kafka topic: Each Kafka connector will create a single consumer thread and place it inside a single consumer group. Consumer group id defaults to the application name as set by the `quarkus.application.name` configuration property. It can also be set using the `kafka.group.id` property.
ja_jp: これは、Kafka トピックをサブスクライブするアプリケーションのデフォルトの動作です。各 Kafka コネクターは、単一のコンシューマースレッドを作成し、それを単一のコンシューマーグループ内に配置します。コンシューマグループ ID のデフォルトは、 `quarkus.application.name` 設定プロパティーで設定されたアプリケーション名です。これは、 `kafka.group.id` プロパティーを使用して設定することもできます。

source: This is the default semantic. If an existing transaction is already associated with the current thread then the transaction is suspended, and resumed once the current transaction is complete. A new transaction is started after the existing transaction is suspended, and follows all the normal lifecycle rules.
ja_jp: これはデフォルトのセマンティックです。もし既存のトランザクションがすでに現在のスレッドと関連している場合、そのトランザクションは中断され、現在のトランザクションが完了すると再開されます。新しいトランザクションは、既存のトランザクションが中断された後に開始され、すべての通常のライフサイクルルールに従います。

source: This is the description that appears in the Assistant section of the log menu.
ja_jp: これは、ログメニューの Assistant セクションに表示される説明です。

source: This is the first phase, and is done by the <<Build Step Processors>>. These processors have access to Jandex annotation information and can parse any descriptors and read annotations, but should not attempt to load any application classes. The output of these build steps is some recorded bytecode, using an extension of the ObjectWeb ASM project called Gizmo(ext/gizmo), that is used to actually bootstrap the application at runtime. Depending on the `io.quarkus.deployment.annotations.ExecutionTime` value of the `@io.quarkus.deployment.annotations.Record` annotation associated with the build step, the step may be run in a different JVM based on the following two modes.
ja_jp: これは最初のフェーズであり、 link:#Build Step Processors[Build Step Processors]によって行われます。これらのプロセッサはJandexのアノテーション情報にアクセスすることができ、任意の記述子を解析してアノテーションを読み取ることができますが、任意のアプリケーションクラスのロードを試みるべきではありません。これらのビルドステップの出力は、Gizmo(ext/gizmo)と呼ばれるObjectWeb ASMプロジェクトのエクステンションを使用して、記録されたバイトコードであり、実行時にアプリケーションを実際にブートストラップするために使用されます。ビルド・ステップに関連する `@io.quarkus.deployment.annotations.Record` アノテーションの `io.quarkus.deployment.annotations.ExecutionTime` 値に応じて、そのステップは以下の2つのモードに基づいて異なるJVMで実行されることがあります。

source: This is the first phase, and is done by the <<build-step-processors>>. These processors have access to Jandex annotation information and can parse any descriptors and read annotations, but should not attempt to load any application classes. The output of these build steps is some recorded bytecode, using a bytecode generation library called https://github.com/quarkusio/gizmo[Gizmo], that is used to actually bootstrap the application at runtime. Depending on the `io.quarkus.deployment.annotations.ExecutionTime` value of the `@io.quarkus.deployment.annotations.Record` annotation associated with the build step, the step may be run in a different JVM based on the following two modes.
ja_jp: これは最初のフェーズで、 <<build-step-processors>> によって行われます。これらのプロセッサーは Jandex のアノテーション情報にアクセスでき、任意のデスクリプターを解析してアノテーションを読み取ることができますが、アプリケーションクラスをロードしようとしてはいけません。これらのビルドステップの出力は、 https://github.com/quarkusio/gizmo[Gizmo] というバイトコード生成ライブラリーを使用して生成された、記録されたバイトコードであり、ランタイムにアプリケーションを実際にブートストラップするために使用されます。ビルドステップに関連付けられた `@io.quarkus.deployment.annotations.Record` アノテーションの `io.quarkus.deployment.annotations.ExecutionTime` 値に応じて、ステップは次の 2 つのモードに基づいて異なる JVM で実行される場合があります。

source: This is the first phase, and is done by the <<build-step-processors>>. These processors have access to Jandex annotation information and can parse any descriptors and read annotations, but should not attempt to load any application classes. The output of these build steps is some recorded bytecode, using an extension of the ObjectWeb ASM project called Gizmo(ext/gizmo), that is used to actually bootstrap the application at runtime. Depending on the `io.quarkus.deployment.annotations.ExecutionTime` value of the `@io.quarkus.deployment.annotations.Record` annotation associated with the build step, the step may be run in a different JVM based on the following two modes.
ja_jp: これは最初のフェーズであり、<<build-step-processors>> によって行われます。これらのプロセッサーは Jandex アノテーション情報にアクセスすることができ、 任意の記述子を解析してアノテーションを読み取ることができますが、任意のアプリケーションクラスのロードは試みないでください。これらのビルドステップの出力は、 Gizmo (ext/gizmo) と呼ばれる ObjectWeb ASM プロジェクトのエクステンションを使用して、記録されたバイトコードであり、実行時にアプリケーションを実際にブートストラップするために使用されます。 ビルドステップに関連する `@io.quarkus.deployment.annotations.Record` アノテーションの `io.quarkus.deployment.annotations.ExecutionTime` 値に応じて、 そのステップは、以下の 2 つのモードに基づいて異なる JVM で実行されることがあります。

source: This is the first post of what I hope will be a series of several articles showing how you can solve complex problems by leveraging the unique Quarkus build infrastructure and extension framework.
ja_jp: この記事は、Quarkus独自のビルドインフラとエクステンションフレームワークを活用して複雑な問題を解決する方法を紹介する、数回にわたる連載の最初の記事です。

source: This is the happiest path, in this case there is no manual instrumentation. We can do a big bang change from OpenTracing to OpenTelemetry without side effects.
ja_jp: これは最も幸せなパスです。この場合、手動の計装はありません。副次的な影響を受けることなく、OpenTracing から OpenTelemetry へビッグバン方式で変更できます。

source: This is the keyboard shortcut that triggers the assistant function.
ja_jp: これは、アシスタント機能をトリガーするキーボードショートカットです。

source: This is the less sophisticated extension. It consists of a set of patches to make sure a library runs on GraalVM. If possible, contribute these patches upstream, not in extensions. Second best is to write Substrate VM substitutions, which are patches applied during native image compilation.
ja_jp: これはあまり洗練されていないエクステンションです。これは、ライブラリがGraalVM上で動作するようにするためのパッチのセットで構成されています。可能であれば、これらのパッチはエクステンションの中ではなく、アップストリームで貢献してください。二番目に良いのは、ネイティブイメージのコンパイル時に適用されるパッチである Substrate VM 置換を書くことです。

source: This is the library needed for Log4j version 2; if you use the legacy Log4j version 1 you need to use `log4j-jboss-logmanager` instead.
ja_jp: これはLog4Jのバージョン2に必要なライブラリです。もしレガシーなLog4Jのバージョン1を使用している場合は、代わりに `log4j-jboss-logmanager` を使用する必要があります。

source: This is the main block.
ja_jp: これがメインブロックです。

source: This is the most common way to output metrics from Micrometer and the default way in Quarkus. The Micrometer Prometheus registry will publish data in the `/q/metrics` endpoint and a scraper inside the Grafana LGTM Dev Service will grab it (*pull* data from the service).
ja_jp: これは、Micrometer からメトリクスを出力する最も一般的な方法であり、Quarkus のデフォルトの方法です。Micrometer Prometheus レジストリーは、 `/q/metrics` エンドポイントでデータを公開し、Grafana LGTM Dev Service 内のスクレイパーがデータを取得します (サービスからデータを *プル* します)。

source: This is the only time during this tutorial when you are expected to manually start Quarkus in dev mode. The configuration and code update steps in the remaining sections of this tutorial are automatically observed and processed by Quarkus without you needing to restart the application manually.
ja_jp: このチュートリアルの中で、手動で Quarkus を開発モードで起動する必要があるのはこの手順のみです。 このチュートリアルの他のセクションでは、設定とコード更新の手順は Quarkus により自動的に監視および処理され、アプリケーションを手動で再起動する必要はありません。

source: This is the preferred solution
ja_jp: これが望ましい解決策です

source: This is the process we optimized by leveraging the parallel compression support provided by Commons Compress.
ja_jp: これは、Commons Compressが提供する並列圧縮サポートを活用することで最適化したプロセスです。

source: This is the reference guide for Quarkus REST. For a more lightweight introduction, please refer to the xref:rest-json.adoc[Writing JSON REST services guides].
ja_jp: Quarkus RESTのリファレンスガイドです。より軽量な紹介については、 xref:rest-json.adoc[JSON RESTサービスの作成ガイドを] 参照してください。

source: This is the reference guide for RESTEasy Reactive. For a more lightweight introduction, please refer to the xref:rest-json.adoc[Writing JSON REST services guides].
ja_jp: 本書は、RESTEasy Reactiveのリファレンスガイドです。よりライトな紹介は、 link:rest-json.html[Writing JSON REST servicesのガイド] を参照してください。

source: This is the reference guide for using virtual threads to write reactive REST services. Please refer to the xref:rest-json.adoc[Writing JSON REST services guides] for a lightweight introduction to reactive REST services and to the xref:resteasy-reactive.adoc[Writing REST Services with RESTEasy Reactive] guide for a detailed presentation.
ja_jp: これは仮想スレッドを使用してリアクティブ REST サービスを記述するためのリファレンスガイドです。リアクティブ REST サービスの軽い導入としてはxref:rest-json.adoc[JSON RESTサービスの実装] を参照してください。詳細な説明については xref:resteasy-reactive.adoc[RESTEASY REACTIVE を使用して REST サービスを作成する] を参照してください。

source: This is the simple case: you just have to write Asciidoc and mark the comment with the `@asciidoclet` tag. This tag has two purposes: it is used as a marker for our generation tool but it is also used by the `javadoc` process for proper Javadoc generation.
ja_jp: これは簡単なケースです: Asciidoc を書いて、コメントに `@asciidoclet` タグを付ければいいだけです。このタグには2つの目的があります: 生成ツールのマーカーとして使用されますが、 `javadoc` のプロセスで適切な Javadoc 生成のためにも使用されます。

source: This is the simple case: you just have to write Asciidoc and mark the comment with the `@asciidoclet` tag. This tag has two purposes: it is used as a marker for our generation tool, but it is also used by the `javadoc` process for proper Javadoc generation.
ja_jp: これは簡単なケースです: Asciidoc を書いて、コメントに `@asciidoclet` タグを付ければいいだけです。このタグには2つの目的があります: 生成ツールのマーカーとして使用されますが、 `javadoc` のプロセスで適切な Javadoc 生成のためにも使用されます。

source: This is the simplest configuration you can have when enabling authentication to your application.
ja_jp: これは、アプリケーションへの認証を有効にする際に最もシンプルな設定です。

source: This is the storage event inside the Cloud Events.
ja_jp: Cloud Eventsの中のストレージイベントです。

source: This is to make the following code behave as one would naively expect:
ja_jp: これは、次のコードを単純に期待どおりに動作させるためです。

source: This is used by the Docker Compose file to use the correct `Dockerfile` when building the `producer` and `aggregator` images. The Kafka Streams application can work with less than 50 MB RSS in native mode. To do so, add the `Xmx` option to the program invocation in `aggregator/src/main/docker/Dockerfile.native`:
ja_jp: これは、 `producer` と `aggregator` のイメージをビルドする際に正しい `Dockerfile` を使用するために Docker Compose ファイルで使用されます。Kafka Streams アプリケーションは、ネイティブモードでは 50 MB 未満の RSS で動作します。そのためには、 `aggregator/src/main/docker/Dockerfile.native` のプログラム呼び出しに `Xmx` オプションを追加します。

source: This is useful as it removes the need to store sensitive data in application.properties.
ja_jp: これは、application.properties に機密データを格納する必要がなくなるので便利です。

source: This is useful for local development, as it allows Quarkus to act as its own certificate authority, which can be used to sign other certificates.
ja_jp: これは、Quarkus が独自の認証局として機能し、他の証明書に署名するために使用できるため、ローカル開発に便利です。

source: This is useful if you wanted to, for example, work on the Fight service in https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus Dev Mode^] and need to have the Hero and Villain services available. From the `+quarkus-super-heroes+` directory, simply run the https://github.com/quarkusio/quarkus-super-heroes/tree/main/rest-fights#only-downstream-dependencies[command based on the version of the application you want to run^]. For example, to run the native Java 17 version, run `+docker-compose -f rest-heroes/deploy/docker-compose/native-java17.yml -f rest-villains/deploy/docker-compose/native-java17.yml up+`.
ja_jp: これは、例えば、 link:https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus Dev Mode, window=_blank]でFightサービスに取り組み、HeroとVillainサービスを利用できるようにする必要がある場合に便利です。 `quarkus-super-heroes` ディレクトリから、 link:https://github.com/quarkusio/quarkus-super-heroes/tree/main/rest-fights#only-downstream-dependencies[実行したいアプリケーションのバージョンに応じたコマンド, window=_blank]を実行するだけです。例えば、ネイティブのJava 17バージョンを実行するには、 `docker-compose -f rest-heroes/deploy/docker-compose/native-java17.yml -f rest-villains/deploy/docker-compose/native-java17.yml up` を実行します。

source: This is useful if your app normally uses Hibernate ORM (which is blocking), but you want to try Hibernate Reactive to see if it works better for your case.
ja_jp: これは、アプリケーションが通常は Hibernate ORM (ブロッキング) を使用しているが、Hibernate Reactive がユースケースにより適しているか試したい場合に役立ちます。

source: This is useful to create a client dynamically in a non-CDI bean e.g a xref:hibernate-orm-panache.adoc[Panache entity]. Or to create a different client when running in pub/sub mode. This mode requires two different connections because once a connection invokes a subscriber mode then it cannot be used for running other commands than the command to leave that mode.
ja_jp: これは、 xref:hibernate-orm-panache.adoc[Panacheエンティティなど] の非CDIビーンで動的にクライアントを作成するのに便利です。あるいは、pub/sub モードで実行するときに別のクライアントを作成します。このモードは、2つの異なる接続を必要とします。 なぜなら、一度接続がサブスクライバモードを呼び出すと、 そのモードを終了するコマンド以外のコマンドを実行するために使用できないからです。

source: This is useful to have a data set ready for your tests or demos.
ja_jp: テストやデモ用のデータセットを用意しておくと便利です。

source: This is useful when creating a certificate for secure communication between your application and external services or clients during development.
ja_jp: これは、開発中にアプリケーションと外部サービスまたはクライアント間でセキュアな通信を確立するための証明書を作成するときに便利です。

source: This is useful when you have a general exception mapper for a parent type (like `RuntimeException`) but want to handle specific wrapped exceptions differently.
ja_jp: これは、親タイプ (例: `RuntimeException`) に対して汎用的な例外マッパーがあるものの、特定のラップされた例外を異なる方法で処理したい場合に役立ちます。

source: This is usually the normal JVM System ClassLoader. In some environments such as Maven it may be different. This ClassLoader is used to load the bootstrap classes, and other ClassLoader instances will delegate the loading of JDK classes to it.
ja_jp: これは通常、通常の JVM System ClassLoader です。Maven のような環境では異なる場合があります。この ClassLoader はブートストラップクラスをロードするために使用され、他の ClassLoader インスタンスは JDK クラスのロードをこれに委譲します。

source: This is where Project Leyden really shines: you get significantly faster startup times compared to a regular JVM, while still retaining all the benefits of running on the JVM.
ja_jp: ここが Project Leyden が真価を発揮する点です。通常の JVM と比較して起動時間が大幅に高速になりながらも、JVM で実行することのすべての利点を保持します。

source: This is where the magic begins: just adding the annotations to our entities makes them available for full text search: we can now query the index using the Hibernate Search DSL.
ja_jp: エンティティにアノテーションを追加するだけで、全文検索が可能になり、Hibernate Search DSLを使ってインデックスにクエリーを投げることができるようになります。

source: This is where the slowness comes from.
ja_jp: 遅さの原因はここにあります。

source: This is why `quarkus.keycloak.devservices.realm-path` is always checked before initializing Keycloak with the default or configured realm, client, user, and roles properties. If the realm file exists on the file system or classpath, then only this realm is used to initialize Keycloak, for example:
ja_jp: このため、Keycloak をデフォルトまたは設定されたレルム、クライアント、ユーザー、およびロールのプロパティーで初期化する前に、常に `quarkus.keycloak.devservices.realm-path` がチェックされます。 realm ファイルがファイルシステムまたはクラスパス上に存在する場合、この realm だけが Keycloak を初期化するために使用されます。次に例を示します。

source: This is why `quarkus.keycloak.devservices.realm-path` is always checked first before trying to initialize Keycloak with the default or configured realm, client, user and roles properties. If the realm file exists on the file system or classpath then only this realm will be used to initialize Keycloak, for example:
ja_jp: このため、デフォルトまたは設定されたレルム、クライアント、ユーザー、ロールのプロパティでKeycloakを初期化しようとする前に、 `quarkus.keycloak.devservices.realm-path` が常に最初にチェックされます。realmファイルがファイルシステムまたはクラスパスに存在する場合、このrealmだけがKeycloakを初期化するために使用されます。例:

source: This is why `quarkus.keycloak.devservices.realm-path` is always checked first before trying to initialize Keycloak with the default or configured realm, client, user and roles properties. If the realm file exists on the file system or classpath then only this realm will be used to initialize Keycloak.
ja_jp: これが、デフォルトまたは設定されたレルム、クライアント、ユーザー、およびロールのプロパティーを使用して Keycloak を初期化する前に、 `quarkus.keycloak.devservices.realm-path` が常に最初にチェックされる理由です。レルムファイルがファイルシステムまたはクラスパスに存在する場合、このレルムのみが Keycloak の初期化に使用されます。

source: This is why the `Fruit` class is annotated with `@Entity`: this annotation marks it as an _entity class_ that is mapped to a Cassandra table. Its instances are meant to be automatically persisted into, and retrieved from the Cassandra database. Here, the table name will be inferred from the class name: `fruit`.
ja_jp: `Fruit` クラスが `@Entity` でアノテーションされているのはそのためです。このアノテーションは、Cassandra テーブルにマッピングされる _エンティティ・クラス_ としてマークします。そのインスタンスは、Cassandra データベースに自動的に永続化され、そこから取得されることになっています。ここでは、テーブル名はクラス名から推測されます: `fruit`。

source: This is why the `Fruit` class is annotated with `@Entity`: this annotation marks it as an _entity class_ that is mapped to a Cassandra table. Its instances are meant to be automatically persisted into, and retrieved from, the Cassandra database. Here, the table name will be inferred from the class name: `fruit`.
ja_jp: これが、 `Fruit` クラスが `@Entity` でアノテーションされている理由です。このアノテーションは、Cassandraテーブルにマッピングされる _エンティティ・クラス_としてマークされます。このクラスのインスタンスは、Cassandraデータベースに自動的に永続化され、そこから取得されます。ここでは、テーブル名はクラス名から推測されます： `fruit` 。

source: This is why we developed a dedicated packaging for Project Leyden: `aot-jar`. It is automatically selected when AOT is enabled, making the transition completely transparent. It uses the same file layout as the `fast-jar` packaging.
ja_jp: これが、Project Leyden 専用のパッケージングである `aot-jar` を開発した理由です。AOT が有効になっている場合、これは自動的に選択され、移行が完全に透過的になります。これは `fast-jar` パッケージングと同じファイルレイアウトを使用します。

source: This is why you have to set `quarkus.oidc.roles.source=accesstoken`, when you prefer to use an access token acquired by the application during the authorizatuion code flow to access this very same application.
ja_jp: 認可コードフロー中にアプリケーションが取得したアクセストークンを、まさにその同じアプリケーションへのアクセスに使用したい場合には、 `quarkus.oidc.roles.source=accesstoken` を設定する必要があります。

source: This isn't defining an exact order, even within a single row. Different extensions have different goals, and different developers will have different views on what capabilities are most important. You may wish to (for example) prioritise a fantastic programming model over enhancing your extension's Dev UI tile. That's fine!
ja_jp: これは、1 行内であっても、正確な順序を定義するものではありません。エクステンションごとに目標が異なり、開発者ごとに最も重要な機能に関する見解が異なります。たとえば、エクステンションの Dev UI タイルの強化よりも、優れたプログラミングモデルを優先する場合があります。それで問題ありません。

source: This isn’t possible, because a dev service would never be started in the build phase. However, the `postStartHook` on the builder allows you to take actions once the dev service is started. To pass configuration to the application, you can https://quarkus.io/guides/writing-extensions#injecting-configuration-into-recorders[use recorders].
ja_jp: Dev Service がビルドフェーズで開始されることはないため、これは不可能です。ただし、ビルダーの `postStartHook` を使用すると、Dev Service が開始された後にアクションを実行できます。アプリケーションに設定を渡すには、 https://quarkus.io/guides/writing-extensions#injecting-configuration-into-recorders[レコーダーを使用] できます。

source: This issue was causing our tests to be unreliable because sometimes ByteBuddy was choosing the wrong method to apply Mockito magic.
ja_jp: この問題は、ByteBuddyがMockitoマジックを適用するために間違った方法を選択することがあり、テストの信頼性を低下させる原因となっていました。

source: This key generator is a CDI bean.
ja_jp: このキージェネレーターはCDI Beanです。

source: This key generator is not a CDI bean.
ja_jp: このキージェネレーターはCDI Beanではありません。

source: This kind of journey naturally comes with its fair share of profiling and staring at flame graphs. It's not just about spotting the hotspots, but also about evaluating whether your changes actually move the needle (in the right direction, hopefully!). In the Java world, we've been lucky to have a tool as powerful as https://github.com/async-profiler/async-profiler[Async Profiler] by our side.
ja_jp: この種の道のりには、当然ながらプロファイリングやフレームグラフを見つめる作業がつきものです。ホットスポットを見つけるだけでなく、自分の変更が実際に状況を改善するのか (願わくば正しい方向に！) 評価することも重要です。Javaの世界では、 https://github.com/async-profiler/async-profiler[Async Profiler] のような強力なツールをそばに持つ幸運に恵まれてきました。

source: This last approach allows you adding extra headers to the output part.
ja_jp: この最後の方法は、出力のパーツに追加のヘッダーを追加することができます。

source: This launches Quarkus
ja_jp: これによりQuarkusが起動します。

source: This leads us to our next section.
ja_jp: これが次のセクションにつながります。

source: This limitation might be removed in the future.
ja_jp: この制限は将来的に削除される可能性があります。

source: This limitation will be alleviated in Jandex 3 but, for the time being, we cannot use Jandex.
ja_jp: この制限はJandex 3で緩和される予定ですが、当面はJandexを使用することはできません。

source: This line is what on Linux and macOS allows you to run it as a script. On Windows this line is ignored.
ja_jp: この行は、Linux や macOS でスクリプトとして実行できるようにするためのものです。Windowsでは、この行は無視されます。

source: This line will only work if the cache was constructed with a `maximum-size` configuration value. Otherwise, an `IllegalStateException` will be thrown.
ja_jp: この行は、キャッシュが `maximum-size` という設定値で構築された場合にのみ機能します。そうでない場合は、 `IllegalStateException` がスローされます。

source: This line will only work if the cache was constructed with an `expire-after-access` configuration value. Otherwise, an `IllegalStateException` will be thrown.
ja_jp: この行は、キャッシュが `expire-after-access` という設定値で構築された場合にのみ機能します。そうでない場合は、 `IllegalStateException` がスローされます。

source: This line will only work if the cache was constructed with an `expire-after-write` configuration value. Otherwise, an `IllegalStateException` will be thrown.
ja_jp: この行は、キャッシュが `expire-after-write` という設定値で構築された場合にのみ機能します。そうでない場合は、 `IllegalStateException` がスローされます。

source: This list of extensions will grow as more services with supported bindings become available on Kubernetes.
ja_jp: このエクステンションのリストは、サポートされたバインディングを持つサービスがKubernetesで利用できるようになるにつれ、増えていきます。

source: This live log view helps developers track behavior, debug issues, and monitor Dev Services without switching to the terminal.
ja_jp: このライブログビューは、開発者が動作を追跡し、問題をデバッグし、ターミナルに切り替えることなく Dev Services を監視するのに役立ちます。

source: This loads all the `-deployment` artifacts and their dependencies, as well as other user dependencies. It does not load the application root or any hot deployed code. This ClassLoader is persistent, even if the application restarts it will remain (which is why it cannot load application classes that may be hot deployed). Its parent is the base ClassLoader, and it is transformer safe.
ja_jp: これは、すべての `-deployment` アーティファクトとその依存関係、および他のユーザー依存関係をロードします。アプリケーションのルートやホットデプロイされたコードはロードしません。この ClassLoader は永続的に動作し、アプリケーションが再起動してもそれは残ります (ホットデプロイされている可能性のあるアプリケーションクラスをロードできないのはそのためです)。親はベースの ClassLoader であり、Transformerセーフです。
